EDT/УТ/src/DataProcessors/зпУправлениеСхемойИТарификациейЗП/зпУправлениеСхемойИТарификациейЗП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>зпУправлениеСхемойИТарификациейЗП</name>
</mdclass:DataProcessor>

EDT/УТ/src/Catalogs/зпСхемыРасчетаЗП/зпСхемыРасчетаЗП.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>зпСхемыРасчетаЗП</name>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>РазрешитьРедактирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СхемаВидовПолигоновПарковки</name>
    <type>
      <types>CatalogRef.зпСхемыВидовПолигоновПарковки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПолигоновПарковкиСтандарт</name>
    <type>
      <types>CatalogRef.зпВидыПолигоновПарковки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидПолигоновПарковкиПовышеннаяОплата</name>
    <type>
      <types>CatalogRef.зпВидыПолигоновПарковки</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СхемыКатегорийЗаказов</name>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>СхемаКатегорий</name>
      <type>
        <types>CatalogRef.зпСхемыКатегорийЗаказов</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>СхемыЗонДоставки</name>
    <attributes>
      <name>ТипЗаказа</name>
      <type>
        <types>EnumRef.ТипыЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>СхемаЗон</name>
      <type>
        <types>CatalogRef.зпСхемыЗонДоставки</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/DataProcessors/зпУправлениеСхемойИТарификациейЗП/Forms/ФормаВводаДанныхТариф/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
    Если Параметры.Свойство("СхемаРасчетаЗП") Тогда
		Запись.СхемаРасчетаЗП = Параметры.СхемаРасчетаЗП;
    КонецЕсли;		
	Если Параметры.Свойство("ТарифРасчетаЗП") Тогда
		Запись.ТарифРасчетаЗП = Параметры.ТарифРасчетаЗП; 
    КонецЕсли;		
	
	Если Параметры.Свойство("Должность") Тогда
		Запись.Должность = Параметры.Должность; 
    КонецЕсли;		
	Если Параметры.Свойство("Роль") Тогда
		Запись.Роль = Параметры.Роль; 
    КонецЕсли;		
	Если Параметры.Свойство("СоставЭкипажа") Тогда
		Запись.СоставЭкипажа = Параметры.СоставЭкипажа; 
    КонецЕсли;		
	Если Параметры.Свойство("ТипЗаказа") Тогда
		Запись.ТипЗаказа = Параметры.ТипЗаказа; 
    КонецЕсли;		
	Если Параметры.Свойство("КатегорияЗаказа") Тогда
		ЗаполнитьКатегорииЗаказов();
		Запись.КатегорияЗаказа = Параметры.КатегорияЗаказа; 
    КонецЕсли;		
	Если Параметры.Свойство("ЗонаДоставки") Тогда
		ЗаполнитьЗоныДоставки();
		Запись.ЗонаДоставки = Параметры.ЗонаДоставки; 
    КонецЕсли;		
	Если Параметры.Свойство("Тариф") Тогда
		Запись.Тариф = Параметры.Тариф; 
    КонецЕсли;		
	
	ЗаполнитьВозможныеТипыЗаказов();
		
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВозможныеТипыЗаказов()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	зпСхемыРасчетаЗПСхемыКатегорийЗаказов.ТипЗаказа КАК ТипЗаказа
		|ИЗ
		|	Справочник.зпСхемыРасчетаЗП.СхемыКатегорийЗаказов КАК зпСхемыРасчетаЗПСхемыКатегорийЗаказов
		|ГДЕ
		|	зпСхемыРасчетаЗПСхемыКатегорийЗаказов.Ссылка = &СхемаРасчетаЗП
		|
		|ОБЪЕДИНИТЬ ВСЕ
		|
		|ВЫБРАТЬ
		|	зпСхемыРасчетаЗПСхемыЗонДоставки.ТипЗаказа
		|ИЗ
		|	Справочник.зпСхемыРасчетаЗП.СхемыЗонДоставки КАК зпСхемыРасчетаЗПСхемыЗонДоставки
		|ГДЕ
		|	зпСхемыРасчетаЗПСхемыЗонДоставки.Ссылка = &СхемаРасчетаЗП";
	
	Запрос.УстановитьПараметр("СхемаРасчетаЗП", 			Запись.СхемаРасчетаЗП);
	Запрос.УстановитьПараметр("ТаблСхемыКатегорийЗаказов", 	Запись.СхемаРасчетаЗП.СхемыКатегорийЗаказов.ВыгрузитьКолонку("СхемаКатегорий"));
	Запрос.УстановитьПараметр("ТаблСхемыЗонДоставки", 		Запись.СхемаРасчетаЗП.СхемыЗонДоставки.ВыгрузитьКолонку("СхемаЗон"));
	
	РезультатЗапросов = Запрос.Выполнить();//ВыполнитьПакет();
	
	ТаблТиповЗаказов = РезультатЗапросов.Выгрузить();
	ТаблТиповЗаказов.Свернуть("ТипЗаказа",);
	Для Каждого строкаТабл Из ТаблТиповЗаказов Цикл 
		Элементы.ТипЗаказа.СписокВыбора.Добавить(строкаТабл.ТипЗаказа);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьКатегорииЗаказов()
	
	Элементы.КатегорияЗаказа.СписокВыбора.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	зпКатегорииЗаказов.Ссылка КАК КатегорияЗаказа
	|ИЗ
	|	Справочник.зпКатегорииЗаказов КАК зпКатегорииЗаказов
	|ГДЕ
	|	зпКатегорииЗаказов.Владелец В (&ТаблСхемыКатегорийЗаказов)
	|	И зпКатегорииЗаказов.Владелец.ТипЗаказа = &ТипЗаказа";
	
	Запрос.УстановитьПараметр("ТаблСхемыКатегорийЗаказов", 	Запись.СхемаРасчетаЗП.СхемыКатегорийЗаказов.ВыгрузитьКолонку("СхемаКатегорий"));
	Запрос.УстановитьПараметр("ТипЗаказа", Запись.ТипЗаказа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблКатегорииЗаказов = РезультатЗапроса.Выгрузить();
	Для Каждого строкаТабл Из ТаблКатегорииЗаказов Цикл 
		Элементы.КатегорияЗаказа.СписокВыбора.Добавить(строкаТабл.КатегорияЗаказа);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗоныДоставки()
	
	Элементы.ЗонаДоставки.СписокВыбора.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	зпЗоныДоставки.Ссылка КАК ЗонаДоставки
	|ИЗ
	|	Справочник.зпЗоныДоставки КАК зпЗоныДоставки
	|ГДЕ
	|	зпЗоныДоставки.Владелец В(&ТаблСхемыЗонДоставки)
	|	И зпЗоныДоставки.Владелец.ТипЗаказа = &ТипЗаказа";
	
	Запрос.УстановитьПараметр("ТаблСхемыЗонДоставки", Запись.СхемаРасчетаЗП.СхемыЗонДоставки.ВыгрузитьКолонку("СхемаЗон"));
	Запрос.УстановитьПараметр("ТипЗаказа", Запись.ТипЗаказа);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ТаблЗоныДоставки = РезультатЗапроса.Выгрузить();
	Для Каждого строкаТабл Из ТаблЗоныДоставки Цикл 
		Элементы.ЗонаДоставки.СписокВыбора.Добавить(строкаТабл.ЗонаДоставки);
	КонецЦикла;
	
КонецПроцедуры


&НаКлиенте
Процедура ТипЗаказаПриИзменении(Элемент)
	ЗаполнитьКатегорииЗаказов();
	ЗаполнитьЗоныДоставки();
КонецПроцедуры
